InformationRegisters/ОбязательстваМаркетМейкеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОбязательстваМаркетМейкеров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРаскрытияИнформации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РежимТоргов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/РежимыБиржевыхТоргов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>РежимыБиржевыхТоргов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРежимаТоргов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КотировкиНеНужны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПереговорныхСделок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичноеРазмещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыкупЭмитентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РЕПО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РЕПО_М</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТПлюс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВнебиржевыхСделок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОбязательстваМаркетМейкеров/Ext/ManagerModule.bsl
Процедура ЗаполнитьТаблицуСоответствияРежимовТоргов(МенеджерВременныхТаблиц) Экспорт

	Если МенеджерВременныхТаблиц.Таблицы.Найти("_СоответствиеРежимовТоргов") <> Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОбязательстваМаркетМейкеров.РежимТоргов КАК РежимТоргов
		|ПОМЕСТИТЬ _РежимыСтрокой
		|ИЗ
		|	РегистрСведений.ОбязательстваМаркетМейкеров КАК ОбязательстваМаркетМейкеров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОбязательстваМаркетМейкеров.РежимТоргов КАК РежимТорговСтрока,
		|	РежимыБиржевыхТоргов.Ссылка КАК РежимТорговСсылка
		|ПОМЕСТИТЬ _СоответствиеРежимовТоргов
		|ИЗ
		|	_РежимыСтрокой КАК ОбязательстваМаркетМейкеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РежимыБиржевыхТоргов КАК РежимыБиржевыхТоргов
		|		ПО (ВЫБОР
		|				КОГДА ОбязательстваМаркетМейкеров.РежимТоргов = ""T+""
		|						ИЛИ ОбязательстваМаркетМейкеров.РежимТоргов = ""Режим основных торгов""
		|					ТОГДА РежимыБиржевыхТоргов.ОсновнойРежим
		|							И РежимыБиржевыхТоргов.ТПлюс
		|				КОГДА ОбязательстваМаркетМейкеров.РежимТоргов = ""РЕПО с Центральным контрагентом 1 день""
		|					ТОГДА РежимыБиржевыхТоргов.Наименование ПОДОБНО ""РЕПО с ЦК 1 день%""
		|				КОГДА ОбязательстваМаркетМейкеров.РежимТоргов = ""РЕПО с Центральным контрагентом с КСУ 1 день""
		|					ТОГДА РежимыБиржевыхТоргов.Наименование ПОДОБНО ""РЕПО с ЦК с КСУ 1 день%""
		|				КОГДА ОбязательстваМаркетМейкеров.РежимТоргов = ""РЕПО с Центральным контрагентом с КСУ 1 месяц""
		|					ТОГДА РежимыБиржевыхТоргов.Наименование ПОДОБНО ""РЕПО с ЦК с КСУ 1 месяц%""
		|				КОГДА ОбязательстваМаркетМейкеров.РежимТоргов = ""РЕПО с Центральным контрагентом с КСУ 2 недели""
		|					ТОГДА РежимыБиржевыхТоргов.Наименование ПОДОБНО ""РЕПО с ЦК с КСУ 14 дн.%""
		|				КОГДА ОбязательстваМаркетМейкеров.РежимТоргов = ""РЕПО с Центральным контрагентом с КСУ 3 месяца""
		|					ТОГДА РежимыБиржевыхТоргов.Наименование ПОДОБНО ""РЕПО с ЦК с КСУ 3 месяца%""
		|				КОГДА ОбязательстваМаркетМейкеров.РежимТоргов = ""РЕПО с Центральным контрагентом с КСУ 7 дней""
		|					ТОГДА РежимыБиржевыхТоргов.Наименование ПОДОБНО ""РЕПО с ЦК с КСУ 7 дн.%""
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _РежимыСтрокой";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Выполнить();

КонецПроцедуры
 
Функция ПолучитьДопустимыеРежимыТоргов() Экспорт
	
	// При добавлении нового режима торгов необходимо доработать процедуру ЗаполнитьТаблицуСоответствияРежимовТоргов данного модуля
		
	МассивДопустимыхРежмовТоргов = Новый Массив;
	МассивДопустимыхРежмовТоргов.Добавить("T+");
	МассивДопустимыхРежмовТоргов.Добавить("Режим основных торгов");
	МассивДопустимыхРежмовТоргов.Добавить("РЕПО с Центральным контрагентом 1 день");
	МассивДопустимыхРежмовТоргов.Добавить("РЕПО с Центральным контрагентом с КСУ 1 день");
	МассивДопустимыхРежмовТоргов.Добавить("РЕПО с Центральным контрагентом с КСУ 1 месяц");
	МассивДопустимыхРежмовТоргов.Добавить("РЕПО с Центральным контрагентом с КСУ 2 недели");
	МассивДопустимыхРежмовТоргов.Добавить("РЕПО с Центральным контрагентом с КСУ 3 месяца");
	МассивДопустимыхРежмовТоргов.Добавить("РЕПО с Центральным контрагентом с КСУ 7 дней");
	
	Возврат МассивДопустимыхРежмовТоргов;
	
КонецФункции
